# SetDocGeoRefByUsrOrg

## Description
Use the current user origin and the specified coordinate system (EPSG) to calculate the adjust internal origin's latitude/longitude.

```pascal
PROCEDURE SetDocGeoRefByUsrOrg(EPSG : INTEGER);
```

```python
def vs.SetDocGeoRefByUsrOrg(EPSG):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|EPSG|INTEGER|   |

## Version
Availability: from Vectorworks 2021

## Category
* GIS